# coding=gbk
"""
@Project ：MyPagination
@File    ：randomcombination.py
@Author  ：Dang FuLin
@Version ：1.0
@Date    ：2022/3/12 20:38
用于产生待入到数据库中的随机数据
"""

import random


def DelRepeat(list_dict, dict_key, list_name):
    """
    去重
    :list_dict: 一个嵌套了字典的列表，列表形如[{'name': '小K', 'score': 100}, {'name': '小J', 'score': 98}, {'name': '小Q', 'score': 95}, {'name': '小J', 'score': 100}]
    :dict_key: 被嵌套字典的键，用于去重
    :list_name:列表，形如['北京四中','成都七中','北京一中','哈尔滨四中']
    :return: 去重后的内容
    """
    # 列表中的字典根据指定的键去重
    result_list_data = []  # 用于存储去重后的list
    values = []  # 用于存储当前已有的值
    for data in list_dict:
        if data[dict_key] not in values:
            result_list_data.append(data)
            values.append(data[dict_key])

    # 普通列表去重
    list_name = list(set(list_name))

    return list_name, result_list_data


def random_combination():
    """
    随机产生数据
    :return: 包含学生信息字典的列表，学校名列表
    """
    first_name = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
                  '何',
                  '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云',
                  '苏',
                  '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍',
                  '史',
                  '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时',
                  '傅',
                  '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪',
                  '祁',
                  '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项',
                  '祝',
                  '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭', '梅', '盛',
                  '林',
                  '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍', ]
    last_name = ['嘉', '琼', '桂', '娣', '叶', '璧', '璐', '娅', '琦', '晶', '妍', '茜', '秋', '珊', '莎', '锦', '黛', '青', '倩', '婷',
                 '姣',
                 '婉', '娴', '瑾', '颖', '露', '瑶', '怡', '婵', '雁', '蓓', '纨', '仪', '荷', '丹', '蓉', '眉', '君', '琴', '蕊', '薇',
                 '菁',
                 '梦', '岚', '苑', '婕', '馨', '瑗', '琰', '韵', '融', '园', '艺', '咏', '卿', '聪', '澜', '纯', '毓', '悦', '昭', '冰',
                 '爽',
                 '琬', '茗', '羽', '希', '宁', '欣', '飘', '育', '滢', '馥', '筠', '柔', '竹', '霭', '凝', '晓', '欢', '霄', '枫', '芸',
                 '菲',
                 '寒', '伊', '亚', '宜', '可', '姬', '舒', '影', '荔', '枝', '思', '丽', '秀', '娟', '英', '华', '慧', '巧', '美', '娜',
                 '静',
                 '淑', '惠', '珠', '翠', '雅', '芝', '玉', '萍', '红', '娥', '玲', '芬', '芳', '燕', '彩', '春', '菊', '勤', '珍', '贞',
                 '莉',
                 '兰', '凤', '洁', '梅', '琳', '素', '云', '莲', '真', '环', '雪', '荣', '爱', '妹', '霞', '香', '月', '莺', '媛', '艳',
                 '瑞',
                 '凡', '佳', '涛', '昌', '进', '林', '有', '坚', '和', '彪', '博', '诚', '先', '敬', '震', '振', '壮', '会', '群', '豪',
                 '心',
                 '邦', '承', '乐', '绍', '功', '松', '善', '厚', '庆', '磊', '民', '友', '裕', '河', '哲', '江', '超', '浩', '亮', '政',
                 '谦',
                 '亨', '奇', '固', '之', '轮', '翰', '朗', '伯', '宏', '言', '若', '鸣', '朋', '斌', '梁', '栋', '维', '启', '克', '伦',
                 '翔',
                 '旭', '鹏', '泽', '晨', '辰', '士', '以', '建', '家', '致', '树', '炎', '德', '行', '时', '泰', '盛', '雄', '琛', '钧',
                 '冠',
                 '策', '腾', '伟', '刚', '勇', '毅', '俊', '峰', '强', '军', '平', '保', '东', '文', '辉', '力', '明', '永', '健', '世',
                 '广',
                 '志', '义', '兴', '良', '海', '山', '仁', '波', '宁', '贵', '福', '生', '龙', '元', '全', '国', '胜', '学', '祥', '才',
                 '发',
                 '成', '康', '星', '光', '天', '达', '安', '岩', '中', '茂', '武', '新', '利', '清', '飞', '彬', '富', '顺', '信', '子',
                 '杰',
                 '楠', '榕', '风', '航', '弘']

    location_name = ['北京', '上海', '广州', '深圳', '成都', '重庆', '杭州', '武汉', '西安', '郑州', '青岛', '长沙', '天津', '苏州', '南京', '东莞',
                     '沈阳',
                     '合肥', '佛山', '昆明', '福州', '无锡', '厦门', '哈尔滨', '长春', '南昌', '济南', '宁波', '大连', '贵阳', '温州', '石家庄', '泉州',
                     '南宁',
                     '金华', '常州', '珠海', '惠州', '嘉兴', '南通', '中山', '保定', '兰州', '台州', '徐州', '太原', '绍兴', '烟台', '廊坊', '海口',
                     '汕头',
                     '潍坊', '扬州', '洛阳', '乌鲁木齐', '临沂', '唐山', '镇江', '盐城', '湖州', '赣州', '漳州', '揭阳', '江门', '桂林', '邯郸', '泰州',
                     '济宁',
                     '呼和浩特', '咸阳', '芜湖', '三亚', '阜阳', '淮安 遵义', '银川', '衡阳', '上饶', '柳州', '淄博', '莆田', '绵阳', '湛江', '商丘',
                     '宜昌',
                     '沧州', '连云港', '南阳', '蚌埠', '驻马店', '滁州', '邢台', '潮州', '秦皇岛', '肇庆', '荆州', '周口', '马鞍山', '清远', '宿州', '威海',
                     '九江', '新乡', '信阳', '襄阳', '岳阳', '安庆', '菏泽', '宜春', '黄冈', '泰安', '宿迁', '株洲', '宁德', '鞍山', '南充', '六安',
                     '大庆',
                     '舟山', '常德', '渭南湖', '孝感', '丽水', '运城', '德州', '张家口', '鄂尔多斯', '阳江', '泸州', '丹东', '曲靖', '乐山', '许昌', '湘潭',
                     '晋中', '安阳', '齐齐哈尔', '北海', '宝鸡', '抚州', '景德镇', '延安', '三明', '抚顺亳州', '日照', '西宁', '衢州', '', '拉萨', '淮北',
                     '焦作', '平顶山', '滨州', '吉安', '濮阳', '眉山', '池州', '荆门', '铜仁', '长治', '衡水', '铜陵', '承德', '达州', '邵阳', '德阳',
                     '龙岩',
                     '南平', '淮南', '黄石', '营口', '东营', '吉林', '韶关', '枣庄', '包头', '怀化', '宣城', '临汾', '聊城', '梅州', '盘锦', '锦州',
                     '榆林',
                     '玉林', '十堰', '汕尾', '咸宁', '宜宾', '永州', '益阳', '黔南州', '黔东南', '恩施', '红河', '大理', '大同', '鄂州', '忻州', '吕梁',
                     '黄山',
                     '开封', '郴州', '茂名', '漯河', '葫芦岛', '河源', '娄底', '延边'
                     ]
    order_name = ['一中', '二中', '三中', '四中', '五中']

    student_info_list = []
    student_info = {}
    school_name_list = []

    # 产生学生数据
    for i in range(1000):
        student_name = random.choice(first_name) + random.choice(last_name)
        student_year = random.randint(10, 20)
        student_email = str(random.randint(100000, 999999999)) + "@qq.com"
        student_info['name'] = student_name
        student_info['year'] = student_year
        student_info['email'] = student_email
        student_info_list.append(student_info)
        student_info = {}

    # 产生学校数据
    for i in range(100):
        school_name = random.choice(location_name) + random.choice(order_name)
        school_name_list.append(school_name)

    # 数据去重
    school_name_list, student_info_list = DelRepeat(student_info_list, 'email', school_name_list)

    return school_name_list, student_info_list


def insertdata():
    """
    批量插入数据
    """
    from pagination.models import SchoolInfo, StudentInfo
    import os, django
    os.environ.setdefault("DJANGO_SETTINGS_MODULE", "MyPagination.settings")
    django.setup()

    school, student = random_combination()

    # 批量插入学校数据
    school_data = []
    try:
        for item in school:
            school_data.append(SchoolInfo(name=item))
        SchoolInfo.objects.bulk_create(school_data)
    except Exception as e:
        print(f"保存学校信息出错：{e.args}")

    # 批量插入学生数据
    student_data = []

    try:
        for item in student:
            school_obj = SchoolInfo.objects.get(id=random.randint(1, len(school)))
            student_data.append(
                StudentInfo(name=item['name'], year=item['year'], email=item['email'], school=school_obj))
        StudentInfo.objects.bulk_create(student_data)
    except Exception as e:
        print(f"保存学生信息出错：{e.args}")


if __name__ == '__main__':
    import os, django

    os.environ.setdefault("DJANGO_SETTINGS_MODULE", "MyPagination.settings")
    django.setup()

    insertdata()
